benchmark/Prices-487k-PricesPerOffering-9.7k/map/wrk2/map-t1-c1-R2000.txt
Running 30s test @ http://127.0.0.1:8091/v1/search/map/prices
  1 threads and 1 connections
  Thread calibration: mean lat.: 31.833ms, rate sampling interval: 193ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.53ms   16.38ms  89.28ms   67.17%
    Req/Sec     2.01k   188.17     2.48k    73.79%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.49ms
 75.000%   28.21ms
 90.000%   41.57ms
 99.000%   70.01ms
 99.900%   86.91ms
 99.990%   89.21ms
 99.999%   89.34ms
100.000%   89.34ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.310     0.000000            1         1.00
       1.301     0.100000         4005         1.11
       3.031     0.200000         8007         1.25
       6.663     0.300000        12007         1.43
      10.463     0.400000        16013         1.67
      14.487     0.500000        20010         2.00
      16.927     0.550000        22011         2.22
      19.263     0.600000        24013         2.50
      21.871     0.650000        26017         2.86
      24.831     0.700000        28014         3.33
      28.207     0.750000        30020         4.00
      30.495     0.775000        31018         4.44
      32.271     0.800000        32025         5.00
      34.079     0.825000        33022         5.71
      36.095     0.850000        34024         6.67
      38.335     0.875000        35021         8.00
      39.871     0.887500        35520         8.89
      41.599     0.900000        36025        10.00
      43.263     0.912500        36521        11.43
      44.927     0.925000        37028        13.33
      46.687     0.937500        37523        16.00
      47.551     0.943750        37768        17.78
      49.023     0.950000        38020        20.00
      50.815     0.956250        38271        22.86
      52.799     0.962500        38521        26.67
      55.615     0.968750        38772        32.00
      57.119     0.971875        38896        35.56
      58.303     0.975000        39019        40.00
      59.679     0.978125        39145        45.71
      61.791     0.981250        39270        53.33
      65.023     0.984375        39395        64.00
      66.303     0.985938        39457        71.11
      68.223     0.987500        39520        80.00
      69.503     0.989062        39587        91.43
      70.911     0.990625        39644       106.67
      74.111     0.992188        39707       128.00
      74.687     0.992969        39741       142.22
      75.711     0.993750        39769       160.00
      77.183     0.994531        39801       182.86
      78.335     0.995313        39832       213.33
      79.359     0.996094        39863       256.00
      80.063     0.996484        39879       284.44
      80.703     0.996875        39894       320.00
      82.175     0.997266        39911       365.71
      83.455     0.997656        39926       426.67
      84.479     0.998047        39941       512.00
      85.055     0.998242        39949       568.89
      85.503     0.998437        39957       640.00
      85.951     0.998633        39965       731.43
      86.655     0.998828        39973       853.33
      86.911     0.999023        39981      1024.00
      86.975     0.999121        39986      1137.78
      87.103     0.999219        39988      1280.00
      87.423     0.999316        39992      1462.86
      87.871     0.999414        39996      1706.67
      88.127     0.999512        40000      2048.00
      88.255     0.999561        40002      2275.56
      88.319     0.999609        40005      2560.00
      88.447     0.999658        40006      2925.71
      88.575     0.999707        40009      3413.33
      88.639     0.999756        40010      4096.00
      88.831     0.999780        40011      4551.11
      88.959     0.999805        40013      5120.00
      88.959     0.999829        40013      5851.43
      89.087     0.999854        40014      6826.67
      89.215     0.999878        40015      8192.00
      89.215     0.999890        40015      9102.22
      89.279     0.999902        40018     10240.00
      89.279     0.999915        40018     11702.86
      89.279     0.999927        40018     13653.33
      89.279     0.999939        40018     16384.00
      89.279     0.999945        40018     18204.44
      89.279     0.999951        40018     20480.00
      89.279     0.999957        40018     23405.71
      89.279     0.999963        40018     27306.67
      89.279     0.999969        40018     32768.00
      89.279     0.999973        40018     36408.89
      89.343     0.999976        40019     40960.00
      89.343     1.000000        40019          inf
#[Mean    =       18.532, StdDeviation   =       16.378]
#[Max     =       89.280, Total count    =        40019]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59997 requests in 30.00s, 11.67MB read
Requests/sec:   1999.89
Transfer/sec:    398.42KB